# Основы работы с pandas | ML0.2 Pandas

### 1.	Получить файл (Titanic.csv) набора данных, прилагающийся к этой работе.

### 2.	Считать файл в pandas DataFrame

In [6]:
import pandas as pd

In [7]:
data = pd.read_csv('Titanic.csv')

In [8]:
data.head()

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

### 3.	Ознакомиться с основными параметрами датасета, используя функции библиотеки pandas, включая следующие данные:

* a.	Количество точек данных (измерений) в наборе

In [11]:
data.size

6565

* b.	Количество полей данных (атрибутов)

In [12]:
print(data.columns, "\nКол-во = {}".format(data.columns.size))

Index(['Name', 'PClass', 'Age', 'Sex', 'Survived'], dtype='object')
Кол-во = 5

* c.	Тип данных каждого поля, шкала каждого поля

In [13]:
print("Type = {} | {}".format(data['PClass'].dtype, data['PClass'].unique()))

Type = object | ['1st' '2nd' nan '3rd']

In [14]:
print("Type = {} | MIN = {}  MAX = {}".format(data['Age'].dtype, data['Age'].min(), data['Age'].max()))

Type = float64 | MIN = 0.17  MAX = 71.0

In [15]:
print("Type = {} | {}".format(data['Sex'].dtype, data['Sex'].unique()))

Type = object | ['female' 'male']

In [16]:
print("Type = {} | {}".format(data['Survived'].dtype, data['Survived'].unique()))

Type = int64 | [1 0]

* d.	Количество отсутствующих значений для каждого поля

In [17]:
data[data['Name'].isna()]

Empty DataFrame
Columns: [Name, PClass, Age, Sex, Survived]
Index: []

In [18]:
data[data['PClass'].isna()]

                    Name PClass  Age   Sex  Survived
456  Jacobsohn Mr Samuel    NaN  NaN  male         0

In [19]:
data[data['Age'].isna()]

                              Name PClass  Age     Sex  Survived
12    Aubert, Mrs Leontine Pauline    1st  NaN  female         1
13        Barkworth, Mr Algernon H    1st  NaN    male         1
14              Baumann, Mr John D    1st  NaN    male         0
29         Borebank, Mr John James    1st  NaN    male         0
32              Bradley, Mr George    1st  NaN    male         1
...                            ...    ...  ...     ...       ...
1300         Wiseman, Mr Phillippe    3rd  NaN    male         0
1302             Yalsevac, Mr Ivan    3rd  NaN    male         1
1305            Youssef, Mr Gerios    3rd  NaN    male         0
1306           Zabour, Miss Hileni    3rd  NaN  female         0
1307           Zabour, Miss Tamini    3rd  NaN  female         0

[557 rows x 5 columns]

In [20]:
data[data['Sex'].isna()]

Empty DataFrame
Columns: [Name, PClass, Age, Sex, Survived]
Index: []

In [21]:
data[data['Survived'].isna()]

Empty DataFrame
Columns: [Name, PClass, Age, Sex, Survived]
Index: []

* e.	Количество и названия константных и уникальных полей

In [22]:
data['PClass'].value_counts()

3rd    711
1st    322
2nd    279
Name: PClass, dtype: int64

In [23]:
data['Age'].value_counts()

22.00    35
30.00    31
21.00    31
18.00    30
36.00    29
         ..
0.80      1
67.00     1
0.33      1
0.17      1
69.00     1
Name: Age, Length: 75, dtype: int64

In [24]:
data['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [25]:
data['Survived'].value_counts()

0    863
1    450
Name: Survived, dtype: int64

### 4.	Удалить из набора поля, не несущие информативной нагрузки - содержащие уникальные либо константные значения

In [40]:
new_data = data.loc[:, data.columns !='Name']
new_data = new_data.dropna()

In [41]:
new_data[new_data.isna().any(1)]

Empty DataFrame
Columns: [PClass, Age, Sex, Survived]
Index: []

###  5.	Заменить возраст пассажиров на год рождения

In [42]:
new_data['Age'].astype(int)

0       29
1        2
2       30
3       25
4        0
        ..
1308    27
1309    26
1310    22
1311    24
1312    29
Name: Age, Length: 756, dtype: int32

In [43]:
year_of_collapse = 1912
new_data['Age'] = year_of_collapse - new_data['Age'].astype(int)

In [44]:
new_data.head()

  PClass   Age     Sex  Survived
0    1st  1883  female         1
1    1st  1910  female         0
2    1st  1882    male         0
3    1st  1887  female         0
4    1st  1912    male         1

###  6.	Переименовать все названия колонок на русском языке

In [45]:
new_data.columns = ['Класс', 'Год Рождения', 'Пол', 'Выжил']

In [46]:
new_data.head()

  Класс  Год Рождения     Пол  Выжил
0   1st          1883  female      1
1   1st          1910  female      0
2   1st          1882    male      0
3   1st          1887  female      0
4   1st          1912    male      1

###  7.	Заменить все отсутствующие данные средним значением (в случае числового поля) либо самым распространенным в категориальных полях.

In [54]:
new_data[new_data.isna().any(1)]

Empty DataFrame
Columns: [Класс, Год Рождения, Пол, Выжил]
Index: []

###  8.	Сохранить получившийся набор данных в формате CSV в файле ФИО_Titanic.csv

In [56]:
new_data.to_csv('ГришинВсеволодВладимирович_Titanic.csv', index=False, encoding='utf-8')

###  9.	Открыть данный файл в программе Microsoft Excel и сохранить в формате .xlsx

In [57]:
df_new = pd.read_csv('ГришинВсеволодВладимирович_Titanic.csv')
df_new

    Класс  Год Рождения     Пол  Выжил
0     1st          1883  female      1
1     1st          1910  female      0
2     1st          1882    male      0
3     1st          1887  female      0
4     1st          1912    male      1
..    ...           ...     ...    ...
751   3rd          1885    male      0
752   3rd          1886    male      0
753   3rd          1890    male      0
754   3rd          1888    male      0
755   3rd          1883    male      0

[756 rows x 4 columns]

In [58]:
writer = pd.ExcelWriter('ГришинВсеволодВладимирович_Titanic.xlsx')
df_new.to_excel(writer, index = False)
writer.save()

###  10.	Считать файл .xlsx в новый DataFrame

In [60]:
excel_data = pd.read_excel('ГришинВсеволодВладимирович_Titanic.xlsx')

In [61]:
excel_data

    Класс  Год Рождения     Пол  Выжил
0     1st          1883  female      1
1     1st          1910  female      0
2     1st          1882    male      0
3     1st          1887  female      0
4     1st          1912    male      1
..    ...           ...     ...    ...
751   3rd          1885    male      0
752   3rd          1886    male      0
753   3rd          1890    male      0
754   3rd          1888    male      0
755   3rd          1883    male      0

[756 rows x 4 columns]

In [ ]:
pd.read

In [64]:
excel_data.drop(columns = ['Класс'],axis = 1)

     Год Рождения     Пол  Выжил
0            1883  female      1
1            1910  female      0
2            1882    male      0
3            1887  female      0
4            1912    male      1
..            ...     ...    ...
751          1885    male      0
752          1886    male      0
753          1890    male      0
754          1888    male      0
755          1883    male      0

[756 rows x 3 columns]

In [65]:
excel_data.drop(labels =[0],axis = 0)

    Класс  Год Рождения     Пол  Выжил
1     1st          1910  female      0
2     1st          1882    male      0
3     1st          1887  female      0
4     1st          1912    male      1
5     1st          1865    male      1
..    ...           ...     ...    ...
751   3rd          1885    male      0
752   3rd          1886    male      0
753   3rd          1890    male      0
754   3rd          1888    male      0
755   3rd          1883    male      0

[755 rows x 4 columns]

# Ответы на Контрольные вопросы

1.	Какие две главные структуры данных используются в pandas? В чем их отличие?
2.	Назовите основные функции чтения данных из файлов
3.	Напишите функцию записи набора данных А в файл с разделителями-запятыми
4.	Как называется функция, выводящая на экран первые N строчек набора данных?
5.	С помощью какой функции можно удалить поле набора данных? А строку?
6.	Напишите участок кода, демонстрирующий возможность добавления новой строки к набору данных. 
7.	Напишите участок кода, демонстрирующий возможность добавления новой колонки (поля) к набору данных.

1) Series — это структура, используемая для работы с последовательностью одномерных данных, а Dataframe — более сложная и подходит для нескольких измерений.

2) read_excel, read_csv

3) A.to_csv('example.csv', sep=',')

4) head(N)

5) 
   * drop(columns = [column_name],axis = 1) Удаляет столбец
   * drop(labels = [number_of_row], axis = 0) Удаляет строку

6) mydataframe = mydataframe.append(new_row, ignore_index=True)

7) mydataframe[new_column] = new_column_data